IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 WS-VARS.
        05 WS-GIVEN-WORD    
             PIC X(40) VALUE '  MAINFRAME IS GOOD      JILL   '.
        05 WS-BUFFER        PIC X(40) VALUE SPACES.
        05 WS-LOOP-CTL      PIC 9(03) VALUE ZEROS.
        05 WS-I             PIC 9(03) VALUE ZEROS.
        05 WS-J             PIC 9(03) VALUE ZEROS.
        05 WS-SPC-CNT-LD    PIC 9(03) VALUE ZEROS.
        05 WS-SPC-CNT-TR    PIC 9(03) VALUE ZEROS.
        05 WS-END-CNT       PIC 9(03) VALUE ZEROS.
        05 WS-REV           PIC X(40) VALUE SPACES.
        05 WS-ACT-LEN       PIC 9(03) VALUE ZEROS.
        05 WS-NEW           PIC X(40) VALUE SPACES.

PROCEDURE DIVISION.
    DISPLAY 'BEFORE REMOVAL OF LEADING AND TRAILING SPACES:'.
    DISPLAY WS-GIVEN-WORD.
    COMPUTE WS-LOOP-CTL = FUNCTION LENGTH(WS-GIVEN-WORD).
    
    PERFORM VARYING WS-I FROM 1 BY 1 
      UNTIL WS-GIVEN-WORD(WS-I:1) NOT = SPACE
            ADD +1 TO WS-SPC-CNT-LD
    END-PERFORM.
    
    MOVE WS-GIVEN-WORD(WS-SPC-CNT-LD:) TO WS-BUFFER.
    PERFORM VARYING WS-I FROM WS-LOOP-CTL BY -1
      UNTIL WS-I = 0
            ADD 1 TO WS-J
            MOVE WS-BUFFER(WS-I:1) TO WS-REV(WS-J:1) 
    END-PERFORM.

    PERFORM VARYING WS-I FROM 1 BY 1 
      UNTIL WS-REV(WS-I:1) NOT = SPACE
            ADD +1 TO WS-SPC-CNT-TR
    END-PERFORM.
    MOVE 0 TO WS-J.
    
    COMPUTE WS-LOOP-CTL = FUNCTION LENGTH(WS-BUFFER).
    COMPUTE WS-ACT-LEN = WS-LOOP-CTL - WS-SPC-CNT-TR.
    PERFORM VARYING WS-I FROM WS-LOOP-CTL BY -1 
       UNTIL WS-I = 0 OR WS-J = WS-ACT-LEN
        ADD 1 TO WS-J
        MOVE WS-REV(WS-SPC-CNT-TR:1) TO WS-NEW(WS-J:1)
        ADD 1 TO WS-SPC-CNT-TR
    END-PERFORM.

    MOVE FUNCTION REVERSE(WS-NEW) TO WS-GIVEN-WORD.

    PERFORM VARYING WS-I FROM 1 BY 1 
      UNTIL WS-GIVEN-WORD(WS-I:1) NOT = SPACE
            ADD +1 TO WS-SPC-CNT-LD
    END-PERFORM.
    
    MOVE WS-GIVEN-WORD(WS-I:) TO WS-BUFFER.
    DISPLAY 'OUTPUT:'WS-BUFFER.

    STOP RUN.
