IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 WS-VARS.
        05 WS-GIVEN-WORD    PIC X(05) VALUE 'MADA '.
        05 WS-INPUT         PIC X(05) VALUE SPACES.
        05 WS-REV           PIC X(05) VALUE SPACES.
        05 WS-I             PIC 9(03) VALUE ZEROS.
        05 WS-J             PIC 9(03) VALUE ZEROS.
        
        
PROCEDURE DIVISION.
    DISPLAY 'GIVEN WORD: ' WS-GIVEN-WORD.
    
    MOVE FUNCTION TRIM(WS-GIVEN-WORD) TO WS-INPUT.
    
    PERFORM VARYING WS-I FROM LENGTH OF WS-INPUT BY -1
      UNTIL WS-I = 0
           ADD 1 TO WS-J
           MOVE WS-INPUT(WS-I:1) TO WS-REV(WS-J:1)
    END-PERFORM.
    
    IF WS-REV = WS-INPUT
        DISPLAY 'IT IS A PALINDROME'
    ELSE
        DISPLAY 'IT IS NOT A PALINDROME'
    END-IF.
    STOP RUN.
