IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 WS-VARS.
        05 WS-GIVEN-WORD    PIC X(05) VALUE 'MADAM'.
        05 WS-INPUT         PIC X(05) VALUE SPACES.
        05 WS-REV           PIC X(05) VALUE SPACES.
        
PROCEDURE DIVISION.
    DISPLAY 'GIVEN WORD: ' WS-GIVEN-WORD.
    MOVE FUNCTION TRIM(WS-GIVEN-WORD) TO WS-INPUT.
    MOVE FUNCTION REVERSE(WS-INPUT) TO WS-REV.
    IF WS-REV = WS-INPUT
        DISPLAY 'IT IS A PALINDROME'
    ELSE
        DISPLAY 'IT IS NOT A PALINDROME'
    END-IF.
    STOP RUN.
