IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 WS-VARS.
        05 WS-GIVEN-WORD    
             PIC X(12) VALUE '  VINODHINI '.
        05 WS-BUFFER        PIC X(40) VALUE SPACES.
        05 WS-REV           PIC X(40) VALUE SPACES.
        05 WS-LOOP-CTL      PIC 9(03) VALUE ZEROS.
        05 WS-I             PIC 9(03) VALUE ZEROS.
        05 WS-J             PIC 9(03) VALUE ZEROS.
        05 WS-OUT           PIC X(12) VALUE SPACES.
        05 WS-LEAD-SPC      PIC 9(03) VALUE ZEROS.
       
PROCEDURE DIVISION.
    DISPLAY 'GIVEN WORD IS :' WS-GIVEN-WORD.
    
    PERFORM VARYING WS-I FROM 1 BY 1 
      UNTIL WS-GIVEN-WORD(WS-I:1) NOT = SPACE
            ADD 1 TO WS-LEAD-SPC
    END-PERFORM.
    MOVE WS-GIVEN-WORD(WS-I:) TO WS-OUT.
    DISPLAY 'LEAD SPC REMD :' WS-OUT
    STOP RUN.
