IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-VARS.
    02 WS-WORD          PIC X(10) VALUE "AGARRO".
    02 WS-I             PIC 9(02) COMP.
    02 WS-J             PIC 9(02) COMP.
    02 WS-REPT-CNT      PIC 9(02) COMP.
    02 WS-NON-DUPS      PIC X(10) VALUE SPACES.
    02 WS-CNT           PIC 9(02) COMP.
    02 WS-CURR-CHAR     PIC X(01) VALUE SPACE.
    02 WS-OUT           PIC X(10) VALUE SPACES.
    02 WS-M             PIC 9(02) COMP.
PROCEDURE DIVISION.
DISPLAY 'ORIGINAL WORD:' WS-WORD.

PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > LENGTH OF WS-WORD
    MOVE WS-WORD(WS-I:1) TO WS-CURR-CHAR
    INSPECT WS-WORD TALLYING WS-REPT-CNT FOR ALL WS-CURR-CHAR
    IF WS-REPT-CNT > 1
        MOVE ZERO TO WS-REPT-CNT 
        INSPECT WS-WORD REPLACING ALL WS-CURR-CHAR 
        BY SPACE AFTER WS-CURR-CHAR 
    END-IF
        MOVE WS-WORD(WS-I:1) TO WS-NON-DUPS(WS-I:1)
END-PERFORM.

PERFORM VARYING WS-J FROM 1 BY 1 
UNTIL WS-J > LENGTH OF WS-NON-DUPS
        IF WS-NON-DUPS(WS-J:1) IS NOT EQUAL TO SPACE
            ADD 1 TO WS-M
            MOVE WS-NON-DUPS(WS-J:1) TO WS-OUT(WS-M:1)
        END-IF
END-PERFORM.

DISPLAY 'NON-DUPS WORD:' WS-OUT.
STOP RUN.
