IDENTIFICATION DIVISION.
PROGRAM-ID. REMOVE-DUPLICATES.
DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-VARS.
    02 WS-WORD          PIC X(10) VALUE "AGARRO".
    02 WS-I             PIC 9(02) COMP VALUE 1.
    02 WS-J             PIC 9(02) COMP VALUE 0.
    02 WS-OUT           PIC X(10) VALUE SPACES.
    02 WS-CURR-CHAR     PIC X(01) VALUE SPACE.
    02 WS-FLAG          PIC X(01) VALUE "N".
    02 WS-M             PIC 9(02) COMP.
    02 WS-NON-DUPS      PIC X(10) VALUE SPACES.

PROCEDURE DIVISION.
DISPLAY 'ORIGINAL WORD:' WS-WORD.

PERFORM VARYING WS-I FROM 1 BY 1 UNTIL WS-I > LENGTH OF WS-WORD
    MOVE WS-WORD(WS-I:1) TO WS-CURR-CHAR
    MOVE "N" TO WS-FLAG

    PERFORM VARYING WS-J FROM 1 BY 1 UNTIL WS-J >= WS-I
        IF WS-CURR-CHAR = WS-WORD(WS-J:1)
            MOVE "Y" TO WS-FLAG
        END-IF
    END-PERFORM

    IF WS-FLAG = "N"
        ADD 1 TO WS-J
        MOVE WS-CURR-CHAR TO WS-OUT(WS-J:1)
    END-IF
END-PERFORM.

PERFORM VARYING WS-J FROM 1 BY 1 
UNTIL WS-J > LENGTH OF WS-OUT
        IF WS-OUT(WS-J:1) IS NOT EQUAL TO SPACE
            ADD 1 TO WS-M
            MOVE WS-OUT(WS-J:1) TO WS-NON-DUPS(WS-M:1)
        END-IF
END-PERFORM.

DISPLAY 'NON-DUPS WORD:' WS-NON-DUPS.
STOP RUN.
