IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 WS-VARS.
        05 WS-GIVEN-WORD    
             PIC X(12) VALUE ' VINODH NI  '.
        05 WS-BUFFER        PIC X(40) VALUE SPACES.
        05 WS-REV           PIC X(40) VALUE SPACES.
        05 WS-LOOP-CTL      PIC 9(03) VALUE ZEROS.
        05 WS-I             PIC 9(03) VALUE ZEROS.
        05 WS-J             PIC 9(03) VALUE ZEROS.
        05 WS-STRT          PIC 9(03) VALUE ZEROS.
        05 WS-END           PIC 9(03) VALUE ZEROS.
        05 WS-OUT           PIC X(12) VALUE SPACES.
        05 WS-TRL-SPC       PIC 9(03) VALUE ZEROS.
        05 WS-LEAD-SPC      PIC 9(03) VALUE ZEROS.
       
PROCEDURE DIVISION.
    DISPLAY 'GIVEN WORD IS :' WS-GIVEN-WORD.
    
    PERFORM VARYING WS-I FROM 1 BY 1 
      UNTIL WS-GIVEN-WORD(WS-I:1) NOT = SPACE
            ADD 1 TO WS-LEAD-SPC
    END-PERFORM.
    COMPUTE WS-STRT = WS-I.
    
    PERFORM VARYING WS-I FROM LENGTH OF WS-GIVEN-WORD BY -1 
      UNTIL WS-GIVEN-WORD(WS-I:1) NOT = SPACE
            ADD 1 TO WS-TRL-SPC
    END-PERFORM.
    
    COMPUTE WS-END = LENGTH OF WS-GIVEN-WORD - WS-TRL-SPC
    MOVE WS-GIVEN-WORD(WS-STRT:WS-END) TO WS-OUT.
    
    DISPLAY 'OUTPUT:' WS-OUT
    
    STOP RUN.
