IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 WS-VARS.
        05 WS-GIVEN-WORD    
             PIC X(12) VALUE ' VINODHINI  '.
        05 WS-BUFFER        PIC X(40) VALUE SPACES.
        05 WS-REV           PIC X(40) VALUE SPACES.
        05 WS-LOOP-CTL      PIC 9(03) VALUE ZEROS.
        05 WS-I             PIC 9(03) VALUE ZEROS.
        05 WS-J             PIC 9(03) VALUE ZEROS.
       
PROCEDURE DIVISION.
    DISPLAY 'GIVEN WORD IS :' WS-GIVEN-WORD.
    
    MOVE FUNCTION TRIM(WS-GIVEN-WORD) TO WS-BUFFER.
    DISPLAY 'AFTER TRIMMING:' WS-BUFFER.
    
    PERFORM VARYING WS-I FROM LENGTH OF WS-BUFFER BY -1
      UNTIL WS-I = 0
            ADD 1 TO WS-J
            MOVE WS-BUFFER(WS-I:1) TO WS-REV(WS-J:1)
    END-PERFORM.
    DISPLAY 'REVERSAL OF THE WORD IS:' FUNCTION TRIM(WS-REV).
    STOP RUN.
